emas/loadtest/emas-performance-report/raw_data/sp1/1cus/varnish_ab_test_1_100000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      1
Time taken for tests:   22.434 seconds
Complete requests:      100000
Failed requests:        0
Write errors:           0
Total transferred:      3255100000 bytes
HTML transferred:       3196600000 bytes
Requests per second:    4457.42 [#/sec] (mean)
Time per request:       0.224 [ms] (mean)
Time per request:       0.224 [ms] (mean, across all concurrent requests)
Transfer rate:          141692.94 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    0   0.0      0      11
Waiting:        0    0   0.0      0      11
Total:          0    0   0.0      0      11

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      0
 100%     11 (longest request)